####################### 表达式和操作符#######################
## 实验目的：体验浮点数计算的误差
## 知识点：基础运算
##        欢迎大家破坏性测试：）       
## email:ppu@cc.ecnu.edu.cn
## update:2022-10-8
###########################################################
##########################################
# 1.问题抛出
##########################################
print("*"*10,"step 2","*"*10)
a=1.1
b=2.2
sum=a+b
print("A:",a,"B:",b,"的和",sum,",数据类型:",type(sum))
print(sum == 3.3) #怎么让sum就是3.3，自行探索
print("*"*28)
##########################################
# 2.问题解决 round
##########################################
print("*"*10,"step 2 round","*"*10)
sum=round(a+b,1)
print(sum == 3.3) #怎么让sum就是3.3，自行探索
print("*"*28)
##########################################
# 3.问题解决 round
##########################################
print("*"*10,"step 3 esp","*"*10)
sum=a+b
esp = 1e-9
abs((2.1-2.0)-0.1)<esp
print(abs(sum-3.3)<esp) #怎么让sum就是3.3，自行探索
print("*"*28)
##########################################
# 4.进一步  整数+浮点数不存在误差
##########################################
print("*"*10,"step 2","*"*10)
a=1.3
b=2
sum=a+b
print(sum == 3.3) #怎么让sum就是3.3，自行探索
print("*"*28)