# 程序填空-统计一组整数中的众数
# 按下列要求对提供程序代码中的下划线进行填空（用填空内容代替下划线，除此之外，不能改动其它任何地方，也不得增删行），调试并运行之。
# 程序功能：从输入的一组半角逗号分隔的整数中找出出现次数最多的数（称为众数），并统计出现次数。(不考虑有多个众数的情况)程序运行示例：
# 输入一组半角逗号分隔的整数：750,1080,1080,750,1080,850,960,2000,1250,1630,1080,1800,1080,2100,1080,1450,2500,560,1080,560
# 众数为1080,出现次数为7。
mystr=input("输入一组半角逗号分隔的整数：")
mylist=mystr.split(",")
myset=set(mylist)
max=0
number=0
for item in myset:
    if(mylist.count(item)>max):
        max=mylist.count(item)
        number=item
print("众数为",number,"出现次数为",max,"。")
    